okme7/nrf52832_icm20948_dmp/app/ICM_20948.c
  // Configure the Accel Alpha Var: 1026019965 (225Hz) 977872018 (112Hz) 882002213 (56Hz)
//  const unsigned char accelAlphaVar[4] = {0x34, 0x92, 0x49, 0x25}; // 56Hz
  const unsigned char accelAlphaVar[4] = {0x3D, 0x27, 0xD2, 0x7D}; // 225Hz
  //const unsigned char accelAlphaVar[4] = {0x3A, 0x49, 0x24, 0x92}; // 112Hz
  result = ICM_20948_writeDMPmems(ACCEL_ALPHA_VAR, 4, &accelAlphaVar[0]); if (result > worstResult) worstResult = result;

  // Configure the Accel A Var: 47721859 (225Hz) 95869806 (112Hz) 191739611 (56Hz)
//  const unsigned char accelAVar[4] = {0x0B, 0x6D, 0xB6, 0xDB}; // 56Hz
  const unsigned char accelAVar[4] = {0x02, 0xD8, 0x2D, 0x83}; // 225Hz
  //const unsigned char accelAVar[4] = {0x05, 0xB6, 0xDB, 0x6E}; // 112Hz
  result = ICM_20948_writeDMPmems(ACCEL_A_VAR, 4, &accelAVar[0]); if (result > worstResult) worstResult = result;

  // Configure the Accel Cal Rate
  const unsigned char accelCalRate[4] = {0x00, 0x00}; // Value taken from InvenSense Nucleo example
  result = ICM_20948_writeDMPmems(ACCEL_CAL_RATE, 2, &accelCalRate[0]); if (result > worstResult) worstResult = result;

  // Configure the Compass Time Buffer. The I2C Master ODR Configuration (see above) sets the magnetometer read rate to 68.75Hz.
  // Let's set the Compass Time Buffer to 69 (Hz).
  const unsigned char compassRate[2] = {0x00, 0x45}; // 69Hz
  result = ICM_20948_writeDMPmems(CPASS_TIME_BUFFER, 2, &compassRate[0]); if (result > worstResult) worstResult = result;

  // Enable DMP interrupt
  // This would be the most efficient way of getting the DMP data, instead of polling the FIFO
  //result = intEnableDMP(true); if (result > worstResult) worstResult = result;

#endif

  return worstResult;
}

// I2C
void ICM_20948_I2C()
{
}

//ICM_20948_Status_e ICM_20948_I2C_begin()
//{
//  // Associate
////  _ad0 = ad0pin;
////  _i2c = &wirePort;
////  _ad0val = ad0val;
////
////  _addr = ICM_20948_I2C_ADDR_AD0;
////  if (_ad0val)
////  {
////    _addr = ICM_20948_I2C_ADDR_AD1;
////  }
////
////  // Set pinmodes
////  if (_ad0 != ICM_20948_ARD_UNUSED_PIN)
////  {
////    pinMode(_ad0, OUTPUT);
////  }
////
////  // Set pins to default positions
////  if (_ad0 != ICM_20948_ARD_UNUSED_PIN)
////  {
////    digitalWrite(_ad0, _ad0val);
////  }

//  // _i2c->begin(); // Moved into user's sketch

//  // Set up the serif
//  I2C_serif.write = ICM_20948_write_I2C;
//  I2C_serif.read = ICM_20948_read_I2C;
////  I2C_Serif_t_initializeserif.user = (void *)this; // refer to yourself in the user field
//	Serif_t_initialize(&I2C_serif);
//  // Link the serif
//  _device._serif = &I2C_serif;

//#if defined(ICM_20948_USE_DMP)
//  _device._dmp_firmware_available = true; // Initialize _dmp_firmware_available
//#else
//  _device._dmp_firmware_available = false; // Initialize _dmp_firmware_available
//#endif

//  _device._firmware_loaded = false; // Initialize _firmware_loaded
//  _device._last_bank = 255;         // Initialize _last_bank. Make it invalid. It will be set by the first call of ICM_20948_set_bank.
//  _device._last_mems_bank = 255;    // Initialize _last_mems_bank. Make it invalid. It will be set by the first call of inv_icm20948_write_mems.
//  _device._gyroSF = 0;              // Use this to record the GyroSF, calculated by inv_icm20948_set_gyro_sf
//  _device._gyroSFpll = 0;
//  _device._enabled_Android_0 = 0;      // Keep track of which Android sensors are enabled: 0-31
//  _device._enabled_Android_1 = 0;      // Keep track of which Android sensors are enabled: 32-
//  _device._enabled_Android_intr_0 = 0; // Keep track of which Android sensor interrupts are enabled: 0-31
//  _device._enabled_Android_intr_1 = 0; // Keep track of which Android sensor interrupts are enabled: 32-

//  // Perform default startup
//  // Do a minimal startupDefault if using the DMP. User can always call startupDefault(false) manually if required.
//  status = ICM_20948_startupDefault(_device._dmp_firmware_available);
//  if (status != ICM_20948_Stat_Ok)
//  {
////    debugPrint(F("ICM_20948_I2C::begin: startupDefault returned: "));
////    debugPrintStatus(status);
////    debugPrintln(F(""));
//  }
//  return status;
//}

ICM_20948_Status_e ICM_20948_startupMagnetometer(bool minimal)
{
  ICM_20948_Status_e retval = ICM_20948_Stat_Ok;

  ICM_20948_i2cMasterPassthrough(false); //Do not connect the SDA/SCL pins to AUX_DA/AUX_CL
  ICM_20948_i2cMasterEnable(true);

  ICM_20948_resetMag();

  //After a ICM reset the Mag sensor may stop responding over the I2C master
  //Reset the Master I2C until it responds
  uint8_t tries = 0;
  while (tries < MAX_MAGNETOMETER_STARTS)
  {
    tries++;

    //See if we can read the WhoIAm register correctly
    retval = ICM_20948_magWhoIAm();
    if (retval == ICM_20948_Stat_Ok)
      break; //WIA matched!

    ICM_20948_i2cMasterReset(); //Otherwise, reset the master I2C and try again

    delay(10);
  }

  if (tries == MAX_MAGNETOMETER_STARTS)
  {
//    debugPrint(F("ICM_20948::startupMagnetometer: reached MAX_MAGNETOMETER_STARTS ("));
//    debugPrintf((int)MAX_MAGNETOMETER_STARTS);
//    debugPrintln(F("). Returning ICM_20948_Stat_WrongID"));
    status = ICM_20948_Stat_WrongID;
    return status;
  }
  else
  {
//    debugPrint(F("ICM_20948::startupMagnetometer: successful magWhoIAm after "));
//    debugPrintf((int)tries);
//    if (tries == 1)
//      debugPrintln(F(" try"));
//    else
//      debugPrintln(F(" tries"));
  }

  //Return now if minimal is true. The mag will be configured manually for the DMP
  if (minimal) // Return now if minimal is true
  {
//    debugPrintln(F("ICM_20948::startupMagnetometer: minimal startup complete!"));
    return status;
  }

  //Set up magnetometer
  AK09916_CNTL2_Reg_t reg;
  reg.MODE = AK09916_mode_cont_100hz;
  reg.reserved_0 = 0; // Make sure the unused bits are clear. Probably redundant, but prevents confusion when looking at the I2C traffic
  retval = ICM_20948_writeMag(AK09916_REG_CNTL2, (uint8_t *)&reg);
  if (retval != ICM_20948_Stat_Ok)
  {
//    debugPrint(F("ICM_20948::startupMagnetometer: writeMag returned: "));
//    debugPrintStatus(retval);
//    debugPrintln(F(""));
    status = retval;
    return status;
  }

