okme7/nrf52832_icm20948_dmp/app/ICM_20948.c
  retval = ICM_20948_i2cControllerConfigurePeripheral(0, MAG_AK09916_I2C_ADDR, AK09916_REG_ST1, 9, true, true, false, false, false, 0);
  if (retval != ICM_20948_Stat_Ok)
  {
//    debugPrint(F("ICM_20948::startupMagnetometer: i2cMasterConfigurePeripheral returned: "));
//    debugPrintStatus(retval);
//    debugPrintln(F(""));
    status = retval;
    return status;
  }

  return status;
}

ICM_20948_Status_e ICM_20948_magWhoIAm(void)
{
  ICM_20948_Status_e retval = ICM_20948_Stat_Ok;

  uint8_t whoiam1, whoiam2;
  whoiam1 = ICM_20948_readMag(AK09916_REG_WIA1);
  // readMag calls i2cMasterSingleR which calls ICM_20948_i2c_master_single_r
  // i2cMasterSingleR updates status so it is OK to set retval to status here
  retval = status;
  if (retval != ICM_20948_Stat_Ok)
  {
//    debugPrint(F("ICM_20948::magWhoIAm: whoiam1: "));
//    debugPrintf((int)whoiam1);
//    debugPrint(F(" (should be 72) readMag set status to: "));
//    debugPrintStatus(status);
//    debugPrintln(F(""));
    return retval;
  }
  whoiam2 = ICM_20948_readMag(AK09916_REG_WIA2);
  // readMag calls i2cMasterSingleR which calls ICM_20948_i2c_master_single_r
  // i2cMasterSingleR updates status so it is OK to set retval to status here
  retval = status;
  if (retval != ICM_20948_Stat_Ok)
  {
//    debugPrint(F("ICM_20948::magWhoIAm: whoiam1: "));
//    debugPrintf((int)whoiam1);
//    debugPrint(F(" (should be 72) whoiam2: "));
//    debugPrintf((int)whoiam2);
//    debugPrint(F(" (should be 9) readMag set status to: "));
//    debugPrintStatus(status);
//    debugPrintln(F(""));
    return retval;
  }

  if ((whoiam1 == (MAG_AK09916_WHO_AM_I >> 8)) && (whoiam2 == (MAG_AK09916_WHO_AM_I & 0xFF)))
  {
    retval = ICM_20948_Stat_Ok;
    status = retval;
    return status;
  }

//  debugPrint(F("ICM_20948::magWhoIAm: whoiam1: "));
//  debugPrintf((int)whoiam1);
//  debugPrint(F(" (should be 72) whoiam2: "));
//  debugPrintf((int)whoiam2);
//  debugPrintln(F(" (should be 9). Returning ICM_20948_Stat_WrongID"));

  retval = ICM_20948_Stat_WrongID;
  status = retval;
  return status;
}

//// SPI
//
//// SPISettings ICM_20948_SPI_DEFAULT_SETTINGS(ICM_20948_SPI_DEFAULT_FREQ, ICM_20948_SPI_DEFAULT_ORDER, ICM_20948_SPI_DEFAULT_MODE);
//
//ICM_20948_SPI::ICM_20948_SPI()
//{
//}
//
ICM_20948_Status_e ICM_20948_SPI_begin()
{
//  if (SPIFreq > 7000000)
//    SPIFreq = 7000000; // Limit SPI frequency to 7MHz

//  // Associate
//  _spi = &spiPort;
//  _spisettings = SPISettings(SPIFreq, ICM_20948_SPI_DEFAULT_ORDER, ICM_20948_SPI_DEFAULT_MODE);
//  _cs = csPin;

//  // Set pinmodes
//  pinMode(_cs, OUTPUT);

//  // Set pins to default positions
//  digitalWrite(_cs, HIGH);

//  // _spi->begin(); // Moved into user's sketch

//  // 'Kickstart' the SPI hardware.
//  _spi->beginTransaction(_spisettings);
//  _spi->transfer(0x00);
//  _spi->endTransaction();

  // Set up the serif
  SPI_serif.write = ICM_20948_write_SPI;
  SPI_serif.read = ICM_20948_read_SPI;
//  SPI_serif.user = (void *)this; // refer to yourself in the user field
	Serif_t_initialize(&SPI_serif);
  // Link the serif
  _device._serif = &SPI_serif;

#if defined(ICM_20948_USE_DMP)
  _device._dmp_firmware_available = true; // Initialize _dmp_firmware_available
#else
  _device._dmp_firmware_available = false; // Initialize _dmp_firmware_available
#endif

  _device._firmware_loaded = false; // Initialize _firmware_loaded
  _device._last_bank = 255;         // Initialize _last_bank. Make it invalid. It will be set by the first call of ICM_20948_set_bank.
  _device._last_mems_bank = 255;    // Initialize _last_mems_bank. Make it invalid. It will be set by the first call of inv_icm20948_write_mems.
  _device._gyroSF = 0;              // Use this to record the GyroSF, calculated by inv_icm20948_set_gyro_sf
  _device._gyroSFpll = 0;
  _device._enabled_Android_0 = 0;      // Keep track of which Android sensors are enabled: 0-31
  _device._enabled_Android_1 = 0;      // Keep track of which Android sensors are enabled: 32-
  _device._enabled_Android_intr_0 = 0; // Keep track of which Android sensor interrupts are enabled: 0-31
  _device._enabled_Android_intr_1 = 0; // Keep track of which Android sensor interrupts are enabled: 32-

  // Perform default startup
  // Do a minimal startupDefault if using the DMP. User can always call startupDefault(false) manually if required.
//	printf("_dmp_firmware_available %d\r\n", _device._dmp_firmware_available);
  status = ICM_20948_startupDefault(_device._dmp_firmware_available);
  if (status != ICM_20948_Stat_Ok)
  {
//    debugPrint(F("ICM_20948_SPI::begin: startupDefault returned: "));
//    debugPrintStatus(status);
//    debugPrintln(F(""));
  }
//	printf("status is %d\r\n",status);
  return status;
	
}


// serif functions for the I2C and SPI classes
ICM_20948_Status_e ICM_20948_write_I2C(uint8_t reg, uint8_t *data, uint32_t len, void *user)
{
  return ICM_20948_Stat_Ok;
}

ICM_20948_Status_e ICM_20948_read_I2C(uint8_t reg, uint8_t *buff, uint32_t len, void *user)
{
  return ICM_20948_Stat_Ok;
}

ICM_20948_Status_e ICM_20948_write_SPI(uint8_t reg, uint8_t *data, uint32_t len, void *user)
{
	(void)user;
	write_multiple_spi(reg, data, len);
  return ICM_20948_Stat_Ok;
}

ICM_20948_Status_e ICM_20948_read_SPI(uint8_t reg, uint8_t *buff, uint32_t len, void *user)
{
	(void)user;
	read_multiple_spi(reg, buff, len);
  return ICM_20948_Stat_Ok;
}
